Table of Contents
 Class FeaApplication
Namespace
IdeaStatiCa.BimApiLink.Plugin
Assembly
IdeaStatiCa.BimApiLink.dll
public class FeaApplication : BimApiApplication, IApplicationBIM
Inheritance
object
ApplicationBIM
BimApiApplication
FeaApplication
Implements
IApplicationBIM
Inherited Members
 BimApiApplication.ApplicationName
 BimApiApplication.ActivateInBIM(List<BIMItemId>)
 BimApiApplication.ActivateMethod(List<BIMItemId>)
 BimApiApplication.IsDataUpToDate()
 BimApiApplication.ImportActive(CountryCode, RequestedItemsType)
 BimApiApplication.ImportSelection(CountryCode, List<BIMItemsGroup>)
 BimApiApplication.CreateScope(CountryCode)
 ApplicationBIM.IdeaStaticaApp
 ApplicationBIM.Progress
 ApplicationBIM.GetActiveSelection()
 ApplicationBIM.Id
 ApplicationBIM.GetActiveSelectionModel(CountryCode, RequestedItemsType)
 ApplicationBIM.GetActiveSelectionModelXML(CountryCode, RequestedItemsType)
 ApplicationBIM.GetActiveSelectionModelXMLAsync(CountryCode, RequestedItemsType)
 ApplicationBIM.GetApplicationName()
 ApplicationBIM.GetModelForSelection(CountryCode, List<BIMItemsGroup>)
 ApplicationBIM.GetModelForSelectionXML(CountryCode, List<BIMItemsGroup>)
 ApplicationBIM.GetModelForSelectionXMLAsync(CountryCode, List<BIMItemsGroup>)
 ApplicationBIM.IsCAD()
 ApplicationBIM.SelectAsync(List<BIMItemId>)
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 FeaApplication(string, IPluginLogger, IProject, IProjectStorage, IBimImporter, IBimApiImporter, IPluginHook, IScopeHook, IBimUserDataSource, TaskScheduler)
public FeaApplication(string applicationName, IPluginLogger logger, IProject project, IProjectStorage projectStorage, IBimImporter bimImporter, IBimApiImporter bimApiImporter, IPluginHook pluginHook, IScopeHook scopeHook, IBimUserDataSource userDataSource, TaskScheduler taskScheduler)
Parameters
applicationName string
logger IPluginLogger
project IProject
projectStorage IProjectStorage
bimImporter IBimImporter
bimApiImporter IBimApiImporter
pluginHook IPluginHook
scopeHook IScopeHook
userDataSource IBimUserDataSource
taskScheduler TaskScheduler
Methods
 ImportSelection(CountryCode, RequestedItemsType)
protected override ModelBIM ImportSelection(CountryCode countryCode, RequestedItemsType requestedType)
Parameters
countryCode CountryCode
requestedType RequestedItemsType
Returns
ModelBIM
 Select(IEnumerable<Identifier<IIdeaNode>>, IEnumerable<Identifier<IIdeaMember1D>>)
protected override void Select(IEnumerable<Identifier<IIdeaNode>> nodes, IEnumerable<Identifier<IIdeaMember1D>> members)
Parameters
nodes IEnumerable<Identifier<IIdeaNode>>
members IEnumerable<Identifier<IIdeaMember1D>>
 Synchronize(CountryCode, List<BIMItemsGroup>)
protected override List<ModelBIM> Synchronize(CountryCode countryCode, List<BIMItemsGroup> items)
Parameters
countryCode CountryCode
items List<BIMItemsGroup>
Returns
List<ModelBIM>
 Edit this page